In [1]:
import pandas as pd

In [3]:
clientes_table = pd.read_csv("../../Homework/Clientes.csv",encoding="utf-8",delimiter=";")

In [4]:
clientes_table = clientes_table.drop(["col10"],axis=1)

In [5]:
clientes_table.rename(columns={"X":"Longitud","Y":"Latitud"},inplace=True)

In [6]:
clientes_table["Latitud"] = clientes_table["Latitud"].astype("str")
clientes_table["Longitud"] = clientes_table["Longitud"].astype("str")

In [7]:
clientes_table["Latitud"] = clientes_table["Latitud"].apply(lambda x: x.replace(",","."))
clientes_table["Longitud"] = clientes_table["Longitud"].apply(lambda x: x.replace(",","."))

In [8]:
clientes_table.head()

,ID,Provincia,Nombre_y_Apellido,Domicilio,Telefono,Edad,Localidad,Longitud,Latitud,Fecha_Alta,Usuario_Alta,Fecha_Ultima_Modificacion,Usuario_Ultima_Modificacion,Marca_Baja
0,1,Buenos Aires,HEBER JONI SANTANA,LAS HERAS Y BAT. 24 DE FEBRERO 4150 RINCON DE...,42-5161,58,LOMA VERDE,-58.81850307,-34.30997088,2015-01-01,user1,2015-01-01,user1,0
1,2,Buenos Aires,ANA SAPRIZA,PUEYRREDON Y DUPUY RUTA3 KM 52.500 S/N BÂº LO...,49-7578,61,SANTA ROSA,-58.73073751,-34.93908311,2015-01-01,user1,2015-01-01,user1,0
2,3,Buenos Aires,FERNANDO LUIS SARALEGUI,CALDERON DE LA BARCA 498,49-3435,15,TORRES,-59.12794068,-34.43082199,2015-01-01,user1,2015-01-01,user1,0
3,4,Buenos Aires,MANUELA SARASOLA,"RUTA 36 KM 45,500 S/N EL PELIGRO",49-2883,29,RUTA SOL,-58.14393954,-34.92052706,2015-01-01,user1,2015-01-01,user1,0
4,5,Buenos Aires,MARIO RAÚL SARASUA,492 Y 186 S/N COLONIA URQUIZA,491-4608,34,JOSE MELCHOR ROMERO,-58.089381,-34.9444471,2015-01-01,user1,2015-01-01,user1,0

In [9]:
clientes_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3407 entries, 0 to 3406
Data columns (total 14 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ID                           3407 non-null   int64
 1   Provincia                    3376 non-null   object
 2   Nombre_y_Apellido            3361 non-null   object
 3   Domicilio                    3359 non-null   object
 4   Telefono                     3317 non-null   object
 5   Edad                         3407 non-null   int64
 6   Localidad                    3375 non-null   object
 7   Longitud                     3407 non-null   object
 8   Latitud                      3407 non-null   object
 9   Fecha_Alta                   3407 non-null   object
 10  Usuario_Alta                 3407 non-null   object
 11  Fecha_Ultima_Modificacion    3407 non-null   object
 12  Usuario_Ultima_Modificacion  3407 non-null   object
 13  Marca_Baja                   3407 non-null   int64
dtypes: int64(3), object(11)
memory usage: 372.8+ KB

In [9]:
clientes_table.to_csv("../../Homework/clientes_clean.csv",index=False,encoding="utf-8")

In [23]:
sucursales_table = pd.read_csv("../../Homework/Sucursales.csv",delimiter=";",encoding="utf-8")

In [27]:
sucursales_table["Latitud"] = sucursales_table["Latitud"].apply(lambda x: x.replace(",","."))
sucursales_table["Longitud"] = sucursales_table["Longitud"].apply(lambda x: x.replace(",","."))

In [32]:
sucursales_table.head()

,ID,Sucursal,Direccion,Localidad,Provincia,Latitud,Longitud
0,1,Cabildo,Av. Cabildo 1342,Ciudad de Buenos Aires,Ciudad de Buenos Aires,-34.5678060,-58.4495720
1,2,Palermo 1,Guatemala 5701,CABA,CABA,-34.5790350,-58.4335660
2,3,Palermo 2,Gral. Lucio Norberto Mansilla 2668,CABA,C deBuenos Aires,-34.5959660,-58.4051500
3,4,Corrientes,Av. Corrientes 2352,Ciudad de Buenos Aires,Bs As,-34.6046850,-58.3987640
4,5,Almagro,Venezuela 3650,Capital,Bs.As.,-34.6173080,-58.4161790

Converting excel's files to csv

In [30]:
sucursales_table.to_csv("../../Homework/Sucursales_clean.csv",index=False,encoding="utf-8")

In [8]:
import openpyxl

In [16]:
import xlrd

In [18]:
canalventa = pd.read_excel('../../Homework/CanalDeVenta.xlsx')
canalventa.to_csv('../../Homework/CanalDeVenta_csv.csv',index=False,encoding="utf-8")

In [19]:
empleados = pd.read_excel('../../Homework/Empleados.xls')
empleados.to_csv('../../Homework/Empleados_csv.csv',index=False,encoding="utf-8")

In [21]:
productos = pd.read_excel('../../Homework/PRODUCTOS.xlsx')
productos.to_csv('../../Homework/Productos_csv.csv',index=False,encoding="utf-8")

In [22]:
proveedores = pd.read_excel('../../Homework/Proveedores.xlsx')
proveedores.to_csv('../../Homework/Proveedores_csv.csv',index=False,encoding="utf-8")

In [164]:
import random

In [3]:
empleados = pd.read_csv('C:/Users/uriel/OneDrive/Documents/Capetas/Data Science/Soy Henry Contenido/Modulo 3/Clase 01/Homework/Empleados_csv.csv',encoding="utf-8")

In [4]:
empleados.head()

,ID_empleado,Apellido,Nombre,Sucursal,Sector,Cargo,Salario
0,1968,Burgos,Jeronimo,Caseros,Administración,Administrativo,32000
1,1674,Villegas,Estefania,Caseros,Administración,Vendedor,32000
2,1516,Fernandez,Guillermo,Caseros,Administración,Vendedor,45000
3,1330,Ramirez,Eliana,Caseros,Administración,Vendedor,32000
4,1657,Carmona,Jose,Caseros,Administración,Vendedor,32000

In [5]:
empleados.ID_empleado.value_counts()

3875    3
1968    2
1725    2
3622    2
3842    2
       ..
1975    1
1759    1
1055    1
1054    1
3545    1
Name: ID_empleado, Length: 250, dtype: int64

Como se puede ver, tenemos valores repetidos en la columna "ID_empleado". Esos valores repetidos debo cambiarlos ya que los campos de 'id' deben ser unicos para que en SQL funcione como primary key

In [6]:
#Unique values only
unique_values = empleados.ID_empleado.unique()

# The amount of rows we have in the df (total of ID's)
total_values = len(empleados)

# A list with all the values between the minimum value and the maximum value
rango = list(range(unique_values.min(),unique_values.max() + 1))

# Removing the unique values from the range with all the values
for i in unique_values:
    rango.remove(i)

In [7]:
# The difference between the total of ID´s and the length from unique_values
dif = (total_values) - len(unique_values)

# A list with all the new's indexes
total = list(unique_values) + rango[:dif]
total.sort()
empleados["IdEmpleado"] = total

Ahora ya no necesitamos mas la columna con los ID's duplicados entonces la eliminamos

In [8]:
empleados.drop(columns = ["ID_empleado"], inplace = True)

In [9]:
empleados = empleados[["IdEmpleado","Nombre","Apellido","Sucursal","Sector","Cargo","Salario"]]
empleados = empleados.set_index("IdEmpleado")

In [10]:
empleados

,Nombre,Apellido,Sucursal,Sector,Cargo,Salario
IdEmpleado,,,,,,
1011,Jeronimo,Burgos,Caseros,Administración,Administrativo,32000
1012,Estefania,Villegas,Caseros,Administración,Vendedor,32000
1013,Guillermo,Fernandez,Caseros,Administración,Vendedor,45000
1014,Eliana,Ramirez,Caseros,Administración,Vendedor,32000
1015,Jose,Carmona,Caseros,Administración,Vendedor,32000
...,...,...,...,...,...,...
3919,Jacobo,Higuita,Bariloche,Administración,Vendedor,13500
3929,Gabriel,Osorio,Bariloche,Administración,Vendedor,12800
3950,Sandra,Gomez,Bariloche,Administración,Técnico,13500
3975,Evelyn,Bustos,Bariloche,Administración,Aux. Administrativo,13500
3979,Juan,Rodas,Bariloche,Administración,Administrativo,56000

Exporto df como un archivo "csv" para luego hacer la ingesta de la data a la tabla empleados en SQL

In [11]:
empleados.to_csv("C:/Users/uriel/OneDrive/Documents/Capetas/Data Science/Soy Henry Contenido/Modulo 3/Clase 01/Homework/Empleados_clean.csv",index=False,encoding="utf-8")